README.org
* My Emacs config and documentation

** Emacs

*** Basics
    - Check the values of variables using =C-h v=

*** Finding
    - =M-x occur= Show definitions
    - =M-x imenu=

*** Jump back
    - ~C-x C-Space~ (accross buffers)
    - ~C-u C-Space~ (buffer only)
  
*** Folding
    - Hideshow

*** Packages
    - =M-x list-packages=
      - Use U to mark all upgradeable packages and x to perform upgrades

** Org-mode

***  [[https://orgmode.org/org.html#Structure-Editing][Structure Editing]]
    - =M-UP= (org-move-subtree-up) Move subtree up
    - =M-DOWN= (org-move-subtree-down) Move subtree down

*** Links
    - [[https://orgmode.org/manual/Handling-links.html][Handling links]]
    - =C-c l= (org-store-link) Store a link to the current location.
    - =C-c C-l= (org-insert-link) When the cursor is on an existing link, link will be edited.
    - =C-c C-o= (org-open-at-point)

*** Export

**** Markdown
     - =M-x org-md-export-to-markdown=
       - ref: [[https://orgmode.org/manual/Markdown-export.html][Markdown export]]
     - For inline code, enclose with = or ~

** Paredit
    - http://danmidwood.com/content/2014/11/21/animated-paredit.html

** Magit

** Resources
    - https://github.com/jaypei/emacs-neotree
    - http://ergoemacs.org/emacs/effective_emacs.html
    - http://pragmaticemacs.com/emacs/join-line-to-previous-line/
    - https://github.com/bbatsov/super-save
    - http://cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and-/
